---
kind: method
id: M:Autodesk.Revit.DB.Structure.LineLoad.GetCurve
source: html/9c5b8a89-b69e-63a3-b93e-8ee058e92874.htm
---
# Autodesk.Revit.DB.Structure.LineLoad.GetCurve Method

Returns curve that define geometry of the line load.

## Syntax (C#)
```csharp
public Curve GetCurve()
```